       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY "HELLO ALURA".
           STOP RUN.
