       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB04.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME PIC X(20) VALUE SPACES.
       01 WRK-CPF.
         02 WRK-CPF-01 PIC 9(3) VALUE ZEROS.
         02 WRK-CPF-02 PIC 9(3) VALUE ZEROS.
         02 WRK-CPF-03 PIC 9(3) VALUE ZEROS.
         02 WRK-CPF-04 PIC 9(2) VALUE ZEROS.
       PROCEDURE DIVISION.
           DISPLAY 'DIGITE O SEU NOME: '.
           ACCEPT WRK-NOME FROM CONSOLE.
           DISPLAY 'DIGITE SEU CPF APENAS NÚMEROS'.
           ACCEPT WRK-CPF FROM CONSOLE.

           DISPLAY 'SEU NOME É ' WRK-NOME.
           DISPLAY 'SEU CPF É '
           WRK-CPF-01'.'WRK-CPF-02'.'WRK-CPF-03'-'WRK-CPF-04.
           STOP RUN.
