       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB03.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WRK-DATA.
         02 WRK-ANO PIC 9(4) VALUE ZEROS.
         02 WRK-MES PIC 9(2) VALUE ZEROS.
         02 WRK-DIA PIC 9(2) VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           DISPLAY 'DATA..' WRK-DATA.
           DISPLAY 'DATA..' WRK-DIA'/'WRK-MES'/'WRK-ANO.
           STOP RUN.
