       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB04.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME PIC X(20) VALUE SPACES.
       77 WRK-CPF  PIC X(11) VALUE ZEROS.
       77 WRK-CPF-ED PIC 999.999.999/99.
       PROCEDURE DIVISION.
           DISPLAY 'DIGITE O SEU NOME: '.
           ACCEPT WRK-NOME FROM CONSOLE.
           DISPLAY 'DIGITE SEU CPF APENAS NÚMEROS'.
           ACCEPT WRK-CPF FROM CONSOLE.
           MOVE WRK-CPF TO WRK-CPF-ED.

           DISPLAY 'SEU NOME É ' WRK-NOME.
           DISPLAY 'SEU CPF É ' WRK-CPF-ED.
           STOP RUN.
