       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WKR-NOME PIC X(20) VALUE SPACES. 
       PROCEDURE DIVISION.
           ACCEPT WKR-NOME FROM CONSOLE.
           DISPLAY 'NOME..' WKR-NOME.
           DISPLAY "NOME TRUNCATE.." WKR-NOME(1:7).
           STOP RUN.
