       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 VENDA1 PIC 9(04)V99 VALUE ZEROS.
       77 VENDA2 PIC 9(04)V99 VALUE ZEROS.
       77 MEDIA PIC 9(06),v99 VALUE ZEROS.
       77 MEDIA-ED PIC $ZZ.ZZ9,99 VALUE ZEROS.
       PROCEDURE DIVISION.
           DISPLAY "QUAL O VALOR DA VENDA 01?"
           ACCEPT VENDA1 FROM CONSOLE.
           
           DISPLAY "QUAL O VALOR DA VENDA 02?"
           ACCEPT VENDA2 FROM CONSOLE.

           COMPUTE MEDIA = (VENDA1 + VENDA2) / 2.
           MOVE MEDIA TO MEDIA-ED.

           DISPLAY 'A MEDIA DE VENDAS É.. ' MEDIA.
           DISPLAY 'A MEDIA DE VENDAS É.. ' MEDIA-ED.

           STOP RUN.
